RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * CMD_FAIL_IRQ (W1C)
 *
 */
#define MTG_TRA_CONTROL_CMD_FAIL_IRQ_MASK (0x8U)
#define MTG_TRA_CONTROL_CMD_FAIL_IRQ_SHIFT (3U)
#define MTG_TRA_CONTROL_CMD_FAIL_IRQ_SET(x) (((uint32_t)(x) << MTG_TRA_CONTROL_CMD_FAIL_IRQ_SHIFT) & MTG_TRA_CONTROL_CMD_FAIL_IRQ_MASK)
#define MTG_TRA_CONTROL_CMD_FAIL_IRQ_GET(x) (((uint32_t)(x) & MTG_TRA_CONTROL_CMD_FAIL_IRQ_MASK) >> MTG_TRA_CONTROL_CMD_FAIL_IRQ_SHIFT)

/*
 * LOCK_IRQ (W1C)
 *
 */
#define MTG_TRA_CONTROL_LOCK_IRQ_MASK (0x4U)
#define MTG_TRA_CONTROL_LOCK_IRQ_SHIFT (2U)
#define MTG_TRA_CONTROL_LOCK_IRQ_SET(x) (((uint32_t)(x) << MTG_TRA_CONTROL_LOCK_IRQ_SHIFT) & MTG_TRA_CONTROL_LOCK_IRQ_MASK)
#define MTG_TRA_CONTROL_LOCK_IRQ_GET(x) (((uint32_t)(x) & MTG_TRA_CONTROL_LOCK_IRQ_MASK) >> MTG_TRA_CONTROL_LOCK_IRQ_SHIFT)

/*
 * SW_LOCK (RW)
 *
 */
#define MTG_TRA_CONTROL_SW_LOCK_MASK (0x2U)
#define MTG_TRA_CONTROL_SW_LOCK_SHIFT (1U)
#define MTG_TRA_CONTROL_SW_LOCK_SET(x) (((uint32_t)(x) << MTG_TRA_CONTROL_SW_LOCK_SHIFT) & MTG_TRA_CONTROL_SW_LOCK_MASK)
#define MTG_TRA_CONTROL_SW_LOCK_GET(x) (((uint32_t)(x) & MTG_TRA_CONTROL_SW_LOCK_MASK) >> MTG_TRA_CONTROL_SW_LOCK_SHIFT)

/*
 * OVALID_CLEAR (RW)
 *
 */
#define MTG_TRA_CONTROL_OVALID_CLEAR_MASK (0x1U)
#define MTG_TRA_CONTROL_OVALID_CLEAR_SHIFT (0U)
#define MTG_TRA_CONTROL_OVALID_CLEAR_SET(x) (((uint32_t)(x) << MTG_TRA_CONTROL_OVALID_CLEAR_SHIFT) & MTG_TRA_CONTROL_OVALID_CLEAR_MASK)
#define MTG_TRA_CONTROL_OVALID_CLEAR_GET(x) (((uint32_t)(x) & MTG_TRA_CONTROL_OVALID_CLEAR_MASK) >> MTG_TRA_CONTROL_OVALID_CLEAR_SHIFT)

/* Bitfield definition for register of struct array TRA: SHIFT */
/*
 * ACC_SHIFT_FAIL_IRQ (W1C)
 *
 */
#define MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_MASK (0x80000000UL)
#define MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_SHIFT (31U)
#define MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_SET(x) (((uint32_t)(x) << MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_SHIFT) & MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_MASK)
#define MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_GET(x) (((uint32_t)(x) & MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_MASK) >> MTG_TRA_SHIFT_ACC_SHIFT_FAIL_IRQ_SHIFT)

/*
 * VEL_SHIFT_FAIL_IRQ (W1C)
 *
 */
#define MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_MASK (0x40000000UL)
#define MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_SHIFT (30U)
#define MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_SET(x) (((uint32_t)(x) << MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_SHIFT) & MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_MASK)
#define MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_GET(x) (((uint32_t)(x) & MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_MASK) >> MTG_TRA_SHIFT_VEL_SHIFT_FAIL_IRQ_SHIFT)

/*
 * SHIFT_FAIL_EN (RW)
 *
 */
#define MTG_TRA_SHIFT_SHIFT_FAIL_EN_MASK (0x20000000UL)
#define MTG_TRA_SHIFT_SHIFT_FAIL_EN_SHIFT (29U)
#define MTG_TRA_SHIFT_SHIFT_FAIL_EN_SET(x) (((uint32_t)(x) << MTG_TRA_SHIFT_SHIFT_FAIL_EN_SHIFT) & MTG_TRA_SHIFT_SHIFT_FAIL_EN_MASK)
#define MTG_TRA_SHIFT_SHIFT_FAIL_EN_GET(x) (((uint32_t)(x) & MTG_TRA_SHIFT_SHIFT_FAIL_EN_MASK) >> MTG_TRA_SHIFT_SHIFT_FAIL_EN_SHIFT)

/*
 * JER_SHIFT (RW)
 *
 */
#define MTG_TRA_SHIFT_JER_SHIFT_MASK (0x700U)
#define MTG_TRA_SHIFT_JER_SHIFT_SHIFT (8U)
#define MTG_TRA_SHIFT_JER_SHIFT_SET(x) (((uint32_t)(x) << MTG_TRA_SHIFT_JER_SHIFT_SHIFT) & MTG_TRA_SHIFT_JER_SHIFT_MASK)
#define MTG_TRA_SHIFT_JER_SHIFT_GET(x) (((uint32_t)(x) & MTG_TRA_SHIFT_JER_SHIFT_MASK) >> MTG_TRA_SHIFT_JER_SHIFT_SHIFT)

/*
 * ACC_SHIFT (RW)
 *
 */
#define MTG_TRA_SHIFT_ACC_SHIFT_MASK (0x70U)
#define MTG_TRA_SHIFT_ACC_SHIFT_SHIFT (4U)
#define MTG_TRA_SHIFT_ACC_SHIFT_SET(x) (((uint32_t)(x) << MTG_TRA_SHIFT_ACC_SHIFT_SHIFT) & MTG_TRA_SHIFT_ACC_SHIFT_MASK)
#define MTG_TRA_SHIFT_ACC_SHIFT_GET(x) (((uint32_t)(x) & MTG_TRA_SHIFT_ACC_SHIFT_MASK) >> MTG_TRA_SHIFT_ACC_SHIFT_SHIFT)

/*
 * VEL_SHIFT (RW)
 *
 */
#define MTG_TRA_SHIFT_VEL_SHIFT_MASK (0xFU)
#define MTG_TRA_SHIFT_VEL_SHIFT_SHIFT (0U)
#define MTG_TRA_SHIFT_VEL_SHIFT_SET(x) (((uint32_t)(x) << MTG_TRA_SHIFT_VEL_SHIFT_SHIFT) & MTG_TRA_SHIFT_VEL_SHIFT_MASK)
#define MTG_TRA_SHIFT_VEL_SHIFT_GET(x) (((uint32_t)(x) & MTG_TRA_SHIFT_VEL_SHIFT_MASK) >> MTG_TRA_SHIFT_VEL_SHIFT_SHIFT)

/* Bitfield definition for register of struct array TRA: LINK */
/*
 * LINK_CFG_3 (RW)
 *
 */
#define MTG_TRA_LINK_LINK_CFG_3_MASK (0x7000U)
#define MTG_TRA_LINK_LINK_CFG_3_SHIFT (12U)
#define MTG_TRA_LINK_LINK_CFG_3_SET(x) (((uint32_t)(x) << MTG_TRA_LINK_LINK_CFG_3_SHIFT) & MTG_TRA_LINK_LINK_CFG_3_MASK)
#define MTG_TRA_LINK_LINK_CFG_3_GET(x) (((uint32_t)(x) & MTG_TRA_LINK_LINK_CFG_3_MASK) >> MTG_TRA_LINK_LINK_CFG_3_SHIFT)

/*
 * LINK_CFG_2 (RW)
 *
 */
#define MTG_TRA_LINK_LINK_CFG_2_MASK (0x700U)
#define MTG_TRA_LINK_LINK_CFG_2_SHIFT (8U)
#define MTG_TRA_LINK_LINK_CFG_2_SET(x) (((uint32_t)(x) << MTG_TRA_LINK_LINK_CFG_2_SHIFT) & MTG_TRA_LINK_LINK_CFG_2_MASK)
#define MTG_TRA_LINK_LINK_CFG_2_GET(x) (((uint32_t)(x) & MTG_TRA_LINK_LINK_CFG_2_MASK) >> MTG_TRA_LINK_LINK_CFG_2_SHIFT)

/*
 * LINK_CFG_1 (RW)
 *
 */
#define MTG_TRA_LINK_LINK_CFG_1_MASK (0x70U)
#define MTG_TRA_LINK_LINK_CFG_1_SHIFT (4U)
#define MTG_TRA_LINK_LINK_CFG_1_SET(x) (((uint32_t)(x) << MTG_TRA_LINK_LINK_CFG_1_SHIFT) & MTG_TRA_LINK_LINK_CFG_1_MASK)
#define MTG_TRA_LINK_LINK_CFG_1_GET(x) (((uint32_t)(x) & MTG_TRA_LINK_LINK_CFG_1_MASK) >> MTG_TRA_LINK_LINK_CFG_1_SHIFT)

/*
 * LINK_CFG_0 (RW)
 *
 */
#define MTG_TRA_LINK_LINK_CFG_0_MASK (0x7U)
#define MTG_TRA_LINK_LINK_CFG_0_SHIFT (0U)
#define MTG_TRA_LINK_LINK_CFG_0_SET(x) (((uint32_t)(x) << MTG_TRA_LINK_LINK_CFG_0_SHIFT) & MTG_TRA_LINK_LINK_CFG_0_MASK)
#define MTG_TRA_LINK_LINK_CFG_0_GET(x) (((uint32_t)(x) & MTG_TRA_LINK_LINK_CFG_0_MASK) >> MTG_TRA_LINK_LINK_CFG_0_SHIFT)

/* Bitfield definition for register of struct array TRA: CONTROL */
/*
 * PASS_IRQ (W1C)
 *
 */
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_MASK (0x80000000UL)
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_SHIFT (31U)
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_CONTROL_PASS_IRQ_SHIFT) & MTG_TRA_CMD_CONTROL_PASS_IRQ_MASK)
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_CONTROL_PASS_IRQ_MASK) >> MTG_TRA_CMD_CONTROL_PASS_IRQ_SHIFT)

/*
 * PASS_IRQ_EN (RW)
 *
 */
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_MASK (0x40000000UL)
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_SHIFT (30U)
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_SHIFT) & MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_MASK)
#define MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_MASK) >> MTG_TRA_CMD_CONTROL_PASS_IRQ_EN_SHIFT)

