RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * MODE (RW)
 *
 */
#define MTG_TRA_CMD_CONTROL_MODE_MASK (0x20000000UL)
#define MTG_TRA_CMD_CONTROL_MODE_SHIFT (29U)
#define MTG_TRA_CMD_CONTROL_MODE_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_CONTROL_MODE_SHIFT) & MTG_TRA_CMD_CONTROL_MODE_MASK)
#define MTG_TRA_CMD_CONTROL_MODE_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_CONTROL_MODE_MASK) >> MTG_TRA_CMD_CONTROL_MODE_SHIFT)

/*
 * OBJECT (RW)
 *
 */
#define MTG_TRA_CMD_CONTROL_OBJECT_MASK (0x1FU)
#define MTG_TRA_CMD_CONTROL_OBJECT_SHIFT (0U)
#define MTG_TRA_CMD_CONTROL_OBJECT_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_CONTROL_OBJECT_SHIFT) & MTG_TRA_CMD_CONTROL_OBJECT_MASK)
#define MTG_TRA_CMD_CONTROL_OBJECT_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_CONTROL_OBJECT_MASK) >> MTG_TRA_CMD_CONTROL_OBJECT_SHIFT)

/* Bitfield definition for register of struct array TRA: REV_PRESET */
/*
 * REV_PRESET (RW)
 *
 */
#define MTG_TRA_CMD_REV_PRESET_REV_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_TRA_CMD_REV_PRESET_REV_PRESET_SHIFT (0U)
#define MTG_TRA_CMD_REV_PRESET_REV_PRESET_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_REV_PRESET_REV_PRESET_SHIFT) & MTG_TRA_CMD_REV_PRESET_REV_PRESET_MASK)
#define MTG_TRA_CMD_REV_PRESET_REV_PRESET_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_REV_PRESET_REV_PRESET_MASK) >> MTG_TRA_CMD_REV_PRESET_REV_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: POS_PRESET */
/*
 * POS_PRESET (RW)
 *
 */
#define MTG_TRA_CMD_POS_PRESET_POS_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_TRA_CMD_POS_PRESET_POS_PRESET_SHIFT (0U)
#define MTG_TRA_CMD_POS_PRESET_POS_PRESET_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_POS_PRESET_POS_PRESET_SHIFT) & MTG_TRA_CMD_POS_PRESET_POS_PRESET_MASK)
#define MTG_TRA_CMD_POS_PRESET_POS_PRESET_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_POS_PRESET_POS_PRESET_MASK) >> MTG_TRA_CMD_POS_PRESET_POS_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_PRESET */
/*
 * VEL_PRESET (RW)
 *
 */
#define MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_SHIFT (0U)
#define MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_SHIFT) & MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_MASK)
#define MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_MASK) >> MTG_TRA_CMD_VEL_PRESET_VEL_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: ACC_PRESET */
/*
 * ACC_PRESET (RW)
 *
 */
#define MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_SHIFT (0U)
#define MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_SHIFT) & MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_MASK)
#define MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_MASK) >> MTG_TRA_CMD_ACC_PRESET_ACC_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: JER_PRESET */
/*
 * JER_PRESET (RW)
 *
 */
#define MTG_TRA_CMD_JER_PRESET_JER_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_TRA_CMD_JER_PRESET_JER_PRESET_SHIFT (0U)
#define MTG_TRA_CMD_JER_PRESET_JER_PRESET_SET(x) (((uint32_t)(x) << MTG_TRA_CMD_JER_PRESET_JER_PRESET_SHIFT) & MTG_TRA_CMD_JER_PRESET_JER_PRESET_MASK)
#define MTG_TRA_CMD_JER_PRESET_JER_PRESET_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_JER_PRESET_JER_PRESET_MASK) >> MTG_TRA_CMD_JER_PRESET_JER_PRESET_SHIFT)

/* Bitfield definition for register of struct array TRA: TIMESTAMP */
/*
 * TIMESTAMP (RO)
 *
 */
#define MTG_TRA_CMD_TIMESTAMP_TIMESTAMP_MASK (0xFFFFFFFFUL)
#define MTG_TRA_CMD_TIMESTAMP_TIMESTAMP_SHIFT (0U)
#define MTG_TRA_CMD_TIMESTAMP_TIMESTAMP_GET(x) (((uint32_t)(x) & MTG_TRA_CMD_TIMESTAMP_TIMESTAMP_MASK) >> MTG_TRA_CMD_TIMESTAMP_TIMESTAMP_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_REV */
/*
 * LOCK_REV (RO)
 *
 */
#define MTG_TRA_LOCK_REV_LOCK_REV_MASK (0xFFFFFFFFUL)
#define MTG_TRA_LOCK_REV_LOCK_REV_SHIFT (0U)
#define MTG_TRA_LOCK_REV_LOCK_REV_GET(x) (((uint32_t)(x) & MTG_TRA_LOCK_REV_LOCK_REV_MASK) >> MTG_TRA_LOCK_REV_LOCK_REV_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_POS */
/*
 * LOCK_POS (RO)
 *
 */
#define MTG_TRA_LOCK_POS_LOCK_POS_MASK (0xFFFFFFFFUL)
#define MTG_TRA_LOCK_POS_LOCK_POS_SHIFT (0U)
#define MTG_TRA_LOCK_POS_LOCK_POS_GET(x) (((uint32_t)(x) & MTG_TRA_LOCK_POS_LOCK_POS_MASK) >> MTG_TRA_LOCK_POS_LOCK_POS_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_VEL */
/*
 * LOCK_VEL (RO)
 *
 */
#define MTG_TRA_LOCK_VEL_LOCK_VEL_MASK (0xFFFFFFFFUL)
#define MTG_TRA_LOCK_VEL_LOCK_VEL_SHIFT (0U)
#define MTG_TRA_LOCK_VEL_LOCK_VEL_GET(x) (((uint32_t)(x) & MTG_TRA_LOCK_VEL_LOCK_VEL_MASK) >> MTG_TRA_LOCK_VEL_LOCK_VEL_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_ACC */
/*
 * LOCK_ACC (RO)
 *
 */
#define MTG_TRA_LOCK_ACC_LOCK_ACC_MASK (0xFFFFFFFFUL)
#define MTG_TRA_LOCK_ACC_LOCK_ACC_SHIFT (0U)
#define MTG_TRA_LOCK_ACC_LOCK_ACC_GET(x) (((uint32_t)(x) & MTG_TRA_LOCK_ACC_LOCK_ACC_MASK) >> MTG_TRA_LOCK_ACC_LOCK_ACC_SHIFT)

/* Bitfield definition for register of struct array TRA: LOCK_TIME */
/*
 * LOCK_TIME (RO)
 *
 */
#define MTG_TRA_LOCK_TIME_LOCK_TIME_MASK (0xFFFFFFFFUL)
#define MTG_TRA_LOCK_TIME_LOCK_TIME_SHIFT (0U)
#define MTG_TRA_LOCK_TIME_LOCK_TIME_GET(x) (((uint32_t)(x) & MTG_TRA_LOCK_TIME_LOCK_TIME_MASK) >> MTG_TRA_LOCK_TIME_LOCK_TIME_SHIFT)

/* Bitfield definition for register of struct array TRA: STEP_LIMIT_CTRL */
/*
 * POS_ONE_WAY_FORCE_MODE (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_MASK (0x1000U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SHIFT (12U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_FORCE_MODE_SHIFT)

/*
 * POS_ONE_WAY_MODE (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_MASK (0x800U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SHIFT (11U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_MODE_SHIFT)

