RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * POS_ONE_WAY_EN (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_MASK (0x400U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SHIFT (10U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_POS_ONE_WAY_EN_SHIFT)

/*
 * POS_STEP_MODE (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_MASK (0x200U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SHIFT (9U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_MODE_SHIFT)

/*
 * POS_STEP_EN (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_MASK (0x100U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SHIFT (8U)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_POS_STEP_EN_SHIFT)

/*
 * VEL_ONE_WAY_MODE (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_MASK (0x4U)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SHIFT (2U)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_MODE_SHIFT)

/*
 * VEL_ONE_WAY_EN (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_MASK (0x2U)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SHIFT (1U)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_VEL_ONE_WAY_EN_SHIFT)

/*
 * VEL_STEP_EN (RW)
 *
 */
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_MASK (0x1U)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SHIFT (0U)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SET(x) (((uint32_t)(x) << MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SHIFT) & MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_MASK)
#define MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_GET(x) (((uint32_t)(x) & MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_MASK) >> MTG_TRA_STEP_LIMIT_CTRL_VEL_STEP_EN_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_STEP_MAX */
/*
 * VEL_STEP_MAX (RW)
 *
 */
#define MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_MASK (0xFFFFFFFFUL)
#define MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SHIFT (0U)
#define MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SET(x) (((uint32_t)(x) << MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SHIFT) & MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_MASK)
#define MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_GET(x) (((uint32_t)(x) & MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_MASK) >> MTG_TRA_VEL_STEP_MAX_VEL_STEP_MAX_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_STEP_MIN */
/*
 * VEL_STEP_MIN (RW)
 *
 */
#define MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_MASK (0xFFFFFFFFUL)
#define MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SHIFT (0U)
#define MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SET(x) (((uint32_t)(x) << MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SHIFT) & MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_MASK)
#define MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_GET(x) (((uint32_t)(x) & MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_MASK) >> MTG_TRA_VEL_STEP_MIN_VEL_STEP_MIN_SHIFT)

/* Bitfield definition for register of struct array TRA: POS_STEP_MAX */
/*
 * POS_STEP_MAX (RW)
 *
 */
#define MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_MASK (0xFFFFFFFFUL)
#define MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_SHIFT (0U)
#define MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_SET(x) (((uint32_t)(x) << MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_SHIFT) & MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_MASK)
#define MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_GET(x) (((uint32_t)(x) & MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_MASK) >> MTG_TRA_POS_STEP_MAX_POS_STEP_MAX_SHIFT)

/* Bitfield definition for register of struct array TRA: POS_STEP_MIN */
/*
 * POS_STEP_MIN (RW)
 *
 */
#define MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_MASK (0xFFFFFFFFUL)
#define MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_SHIFT (0U)
#define MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_SET(x) (((uint32_t)(x) << MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_SHIFT) & MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_MASK)
#define MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_GET(x) (((uint32_t)(x) & MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_MASK) >> MTG_TRA_POS_STEP_MIN_POS_STEP_MIN_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_LIMIT_P */
/*
 * VEL_LIMIT_P (RW)
 *
 */
#define MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_MASK (0xFFFFFFFFUL)
#define MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SHIFT (0U)
#define MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SET(x) (((uint32_t)(x) << MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SHIFT) & MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_MASK)
#define MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_GET(x) (((uint32_t)(x) & MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_MASK) >> MTG_TRA_VEL_LIMIT_P_VEL_LIMIT_P_SHIFT)

/* Bitfield definition for register of struct array TRA: VEL_LIMIT_N */
/*
 * VEL_LIMIT_N (RW)
 *
 */
#define MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_MASK (0xFFFFFFFFUL)
#define MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SHIFT (0U)
#define MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SET(x) (((uint32_t)(x) << MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SHIFT) & MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_MASK)
#define MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_GET(x) (((uint32_t)(x) & MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_MASK) >> MTG_TRA_VEL_LIMIT_N_VEL_LIMIT_N_SHIFT)

/* Bitfield definition for register of struct array EVENT: CONTROL */
/*
 * ENABLE (RW)
 *
 */
#define MTG_EVENT_CONTROL_ENABLE_MASK (0x80000000UL)
#define MTG_EVENT_CONTROL_ENABLE_SHIFT (31U)
#define MTG_EVENT_CONTROL_ENABLE_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_ENABLE_SHIFT) & MTG_EVENT_CONTROL_ENABLE_MASK)
#define MTG_EVENT_CONTROL_ENABLE_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_ENABLE_MASK) >> MTG_EVENT_CONTROL_ENABLE_SHIFT)

