RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * SOURCE_MUX (RW)
 *
 */
#define MTG_EVENT_CONTROL_SOURCE_MUX_MASK (0x78000000UL)
#define MTG_EVENT_CONTROL_SOURCE_MUX_SHIFT (27U)
#define MTG_EVENT_CONTROL_SOURCE_MUX_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_SOURCE_MUX_SHIFT) & MTG_EVENT_CONTROL_SOURCE_MUX_MASK)
#define MTG_EVENT_CONTROL_SOURCE_MUX_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_SOURCE_MUX_MASK) >> MTG_EVENT_CONTROL_SOURCE_MUX_SHIFT)

/*
 * OBJECT (RW)
 *
 */
#define MTG_EVENT_CONTROL_OBJECT_MASK (0x7800000UL)
#define MTG_EVENT_CONTROL_OBJECT_SHIFT (23U)
#define MTG_EVENT_CONTROL_OBJECT_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_OBJECT_SHIFT) & MTG_EVENT_CONTROL_OBJECT_MASK)
#define MTG_EVENT_CONTROL_OBJECT_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_OBJECT_MASK) >> MTG_EVENT_CONTROL_OBJECT_SHIFT)

/*
 * MODE (RW)
 *
 */
#define MTG_EVENT_CONTROL_MODE_MASK (0x780000UL)
#define MTG_EVENT_CONTROL_MODE_SHIFT (19U)
#define MTG_EVENT_CONTROL_MODE_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_MODE_SHIFT) & MTG_EVENT_CONTROL_MODE_MASK)
#define MTG_EVENT_CONTROL_MODE_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_MODE_MASK) >> MTG_EVENT_CONTROL_MODE_SHIFT)

/*
 * DIR (RW)
 *
 */
#define MTG_EVENT_CONTROL_DIR_MASK (0x60000UL)
#define MTG_EVENT_CONTROL_DIR_SHIFT (17U)
#define MTG_EVENT_CONTROL_DIR_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_DIR_SHIFT) & MTG_EVENT_CONTROL_DIR_MASK)
#define MTG_EVENT_CONTROL_DIR_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_DIR_MASK) >> MTG_EVENT_CONTROL_DIR_SHIFT)

/*
 * DIR_MODE (RW)
 *
 */
#define MTG_EVENT_CONTROL_DIR_MODE_MASK (0x10000UL)
#define MTG_EVENT_CONTROL_DIR_MODE_SHIFT (16U)
#define MTG_EVENT_CONTROL_DIR_MODE_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_DIR_MODE_SHIFT) & MTG_EVENT_CONTROL_DIR_MODE_MASK)
#define MTG_EVENT_CONTROL_DIR_MODE_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_DIR_MODE_MASK) >> MTG_EVENT_CONTROL_DIR_MODE_SHIFT)

/*
 * OVER_MODE_CMP (RW)
 *
 */
#define MTG_EVENT_CONTROL_OVER_MODE_CMP_MASK (0x8000U)
#define MTG_EVENT_CONTROL_OVER_MODE_CMP_SHIFT (15U)
#define MTG_EVENT_CONTROL_OVER_MODE_CMP_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_OVER_MODE_CMP_SHIFT) & MTG_EVENT_CONTROL_OVER_MODE_CMP_MASK)
#define MTG_EVENT_CONTROL_OVER_MODE_CMP_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_OVER_MODE_CMP_MASK) >> MTG_EVENT_CONTROL_OVER_MODE_CMP_SHIFT)

/*
 * TRIG_NUM (RW)
 *
 */
#define MTG_EVENT_CONTROL_TRIG_NUM_MASK (0x4000U)
#define MTG_EVENT_CONTROL_TRIG_NUM_SHIFT (14U)
#define MTG_EVENT_CONTROL_TRIG_NUM_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_TRIG_NUM_SHIFT) & MTG_EVENT_CONTROL_TRIG_NUM_MASK)
#define MTG_EVENT_CONTROL_TRIG_NUM_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_TRIG_NUM_MASK) >> MTG_EVENT_CONTROL_TRIG_NUM_SHIFT)

/*
 * EVENT_OVER_IRQ_EN (RW)
 *
 */
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_MASK (0x8U)
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_SHIFT (3U)
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_SHIFT) & MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_MASK)
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_MASK) >> MTG_EVENT_CONTROL_EVENT_OVER_IRQ_EN_SHIFT)

/*
 * EVENT_IRQ_EN (RW)
 *
 */
#define MTG_EVENT_CONTROL_EVENT_IRQ_EN_MASK (0x4U)
#define MTG_EVENT_CONTROL_EVENT_IRQ_EN_SHIFT (2U)
#define MTG_EVENT_CONTROL_EVENT_IRQ_EN_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_EVENT_IRQ_EN_SHIFT) & MTG_EVENT_CONTROL_EVENT_IRQ_EN_MASK)
#define MTG_EVENT_CONTROL_EVENT_IRQ_EN_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_EVENT_IRQ_EN_MASK) >> MTG_EVENT_CONTROL_EVENT_IRQ_EN_SHIFT)

/*
 * EVENT_OVER_IRQ (W1C)
 *
 */
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_MASK (0x2U)
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_SHIFT (1U)
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_EVENT_OVER_IRQ_SHIFT) & MTG_EVENT_CONTROL_EVENT_OVER_IRQ_MASK)
#define MTG_EVENT_CONTROL_EVENT_OVER_IRQ_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_EVENT_OVER_IRQ_MASK) >> MTG_EVENT_CONTROL_EVENT_OVER_IRQ_SHIFT)

/*
 * EVENT_IRQ (W1C)
 *
 */
#define MTG_EVENT_CONTROL_EVENT_IRQ_MASK (0x1U)
#define MTG_EVENT_CONTROL_EVENT_IRQ_SHIFT (0U)
#define MTG_EVENT_CONTROL_EVENT_IRQ_SET(x) (((uint32_t)(x) << MTG_EVENT_CONTROL_EVENT_IRQ_SHIFT) & MTG_EVENT_CONTROL_EVENT_IRQ_MASK)
#define MTG_EVENT_CONTROL_EVENT_IRQ_GET(x) (((uint32_t)(x) & MTG_EVENT_CONTROL_EVENT_IRQ_MASK) >> MTG_EVENT_CONTROL_EVENT_IRQ_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_0 */
/*
 * PRESET (RW)
 *
 */
#define MTG_EVENT_PRESET_0_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_EVENT_PRESET_0_PRESET_SHIFT (0U)
#define MTG_EVENT_PRESET_0_PRESET_SET(x) (((uint32_t)(x) << MTG_EVENT_PRESET_0_PRESET_SHIFT) & MTG_EVENT_PRESET_0_PRESET_MASK)
#define MTG_EVENT_PRESET_0_PRESET_GET(x) (((uint32_t)(x) & MTG_EVENT_PRESET_0_PRESET_MASK) >> MTG_EVENT_PRESET_0_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_1 */
/*
 * PRESET (RW)
 *
 */
#define MTG_EVENT_PRESET_1_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_EVENT_PRESET_1_PRESET_SHIFT (0U)
#define MTG_EVENT_PRESET_1_PRESET_SET(x) (((uint32_t)(x) << MTG_EVENT_PRESET_1_PRESET_SHIFT) & MTG_EVENT_PRESET_1_PRESET_MASK)
#define MTG_EVENT_PRESET_1_PRESET_GET(x) (((uint32_t)(x) & MTG_EVENT_PRESET_1_PRESET_MASK) >> MTG_EVENT_PRESET_1_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_2 */
/*
 * PRESET (RW)
 *
 */
#define MTG_EVENT_PRESET_2_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_EVENT_PRESET_2_PRESET_SHIFT (0U)
#define MTG_EVENT_PRESET_2_PRESET_SET(x) (((uint32_t)(x) << MTG_EVENT_PRESET_2_PRESET_SHIFT) & MTG_EVENT_PRESET_2_PRESET_MASK)
#define MTG_EVENT_PRESET_2_PRESET_GET(x) (((uint32_t)(x) & MTG_EVENT_PRESET_2_PRESET_MASK) >> MTG_EVENT_PRESET_2_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: PRESET_3 */
/*
 * PRESET (RW)
 *
 */
#define MTG_EVENT_PRESET_3_PRESET_MASK (0xFFFFFFFFUL)
#define MTG_EVENT_PRESET_3_PRESET_SHIFT (0U)
#define MTG_EVENT_PRESET_3_PRESET_SET(x) (((uint32_t)(x) << MTG_EVENT_PRESET_3_PRESET_SHIFT) & MTG_EVENT_PRESET_3_PRESET_MASK)
#define MTG_EVENT_PRESET_3_PRESET_GET(x) (((uint32_t)(x) & MTG_EVENT_PRESET_3_PRESET_MASK) >> MTG_EVENT_PRESET_3_PRESET_SHIFT)

/* Bitfield definition for register of struct array EVENT: TIMESTAMP */
/*
 * TIMESTAMP (RO)
 *
 */
#define MTG_EVENT_TIMESTAMP_TIMESTAMP_MASK (0xFFFFFFFFUL)
#define MTG_EVENT_TIMESTAMP_TIMESTAMP_SHIFT (0U)
#define MTG_EVENT_TIMESTAMP_TIMESTAMP_GET(x) (((uint32_t)(x) & MTG_EVENT_TIMESTAMP_TIMESTAMP_MASK) >> MTG_EVENT_TIMESTAMP_TIMESTAMP_SHIFT)

