RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/* Bitfield definition for register: SW_EVENT */
/*
 * SW_EVENT_TRIG (RW)
 *
 */
#define MTG_SW_EVENT_SW_EVENT_TRIG_MASK (0x1U)
#define MTG_SW_EVENT_SW_EVENT_TRIG_SHIFT (0U)
#define MTG_SW_EVENT_SW_EVENT_TRIG_SET(x) (((uint32_t)(x) << MTG_SW_EVENT_SW_EVENT_TRIG_SHIFT) & MTG_SW_EVENT_SW_EVENT_TRIG_MASK)
#define MTG_SW_EVENT_SW_EVENT_TRIG_GET(x) (((uint32_t)(x) & MTG_SW_EVENT_SW_EVENT_TRIG_MASK) >> MTG_SW_EVENT_SW_EVENT_TRIG_SHIFT)

/* Bitfield definition for register: SW_GLB_RESET */
/*
 * SW_GLB_RESET (WO)
 *
 */
#define MTG_SW_GLB_RESET_SW_GLB_RESET_MASK (0x1U)
#define MTG_SW_GLB_RESET_SW_GLB_RESET_SHIFT (0U)
#define MTG_SW_GLB_RESET_SW_GLB_RESET_SET(x) (((uint32_t)(x) << MTG_SW_GLB_RESET_SW_GLB_RESET_SHIFT) & MTG_SW_GLB_RESET_SW_GLB_RESET_MASK)
#define MTG_SW_GLB_RESET_SW_GLB_RESET_GET(x) (((uint32_t)(x) & MTG_SW_GLB_RESET_SW_GLB_RESET_MASK) >> MTG_SW_GLB_RESET_SW_GLB_RESET_SHIFT)

/* Bitfield definition for register: FILTER_CONTROL */
/*
 * MUL_ERR_IRQ_0 (W1C)
 *
 */
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_MASK (0x80000000UL)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_SHIFT (31U)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_SHIFT) & MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_MASK)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_MASK) >> MTG_FILTER_CONTROL_MUL_ERR_IRQ_0_SHIFT)

/*
 * MUL_ERR_IRQ_1 (W1C)
 *
 */
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_MASK (0x40000000UL)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_SHIFT (30U)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_SHIFT) & MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_MASK)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_MASK) >> MTG_FILTER_CONTROL_MUL_ERR_IRQ_1_SHIFT)

/*
 * MUL_ERR_IRQ_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_MASK (0x20000000UL)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_SHIFT (29U)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_SHIFT) & MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_MASK)
#define MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_MASK) >> MTG_FILTER_CONTROL_MUL_ERR_IRQ_EN_SHIFT)

/*
 * ERR_BYPASS_STATUS (RO)
 *
 */
#define MTG_FILTER_CONTROL_ERR_BYPASS_STATUS_MASK (0x800000UL)
#define MTG_FILTER_CONTROL_ERR_BYPASS_STATUS_SHIFT (23U)
#define MTG_FILTER_CONTROL_ERR_BYPASS_STATUS_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_ERR_BYPASS_STATUS_MASK) >> MTG_FILTER_CONTROL_ERR_BYPASS_STATUS_SHIFT)

/*
 * ERR_BYPASS_F_I_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_MASK (0x400000UL)
#define MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SHIFT (22U)
#define MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SHIFT) & MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_MASK)
#define MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_MASK) >> MTG_FILTER_CONTROL_ERR_BYPASS_F_I_EN_SHIFT)

/*
 * ERR_BYPASS_I_F_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_MASK (0x200000UL)
#define MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SHIFT (21U)
#define MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SHIFT) & MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_MASK)
#define MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_MASK) >> MTG_FILTER_CONTROL_ERR_BYPASS_I_F_EN_SHIFT)

/*
 * SW_LOCK (RW)
 *
 */
#define MTG_FILTER_CONTROL_SW_LOCK_MASK (0x100000UL)
#define MTG_FILTER_CONTROL_SW_LOCK_SHIFT (20U)
#define MTG_FILTER_CONTROL_SW_LOCK_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_SW_LOCK_SHIFT) & MTG_FILTER_CONTROL_SW_LOCK_MASK)
#define MTG_FILTER_CONTROL_SW_LOCK_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_SW_LOCK_MASK) >> MTG_FILTER_CONTROL_SW_LOCK_SHIFT)

/*
 * TIMEOUT_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_TIMEOUT_EN_MASK (0x80000UL)
#define MTG_FILTER_CONTROL_TIMEOUT_EN_SHIFT (19U)
#define MTG_FILTER_CONTROL_TIMEOUT_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_TIMEOUT_EN_SHIFT) & MTG_FILTER_CONTROL_TIMEOUT_EN_MASK)
#define MTG_FILTER_CONTROL_TIMEOUT_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_TIMEOUT_EN_MASK) >> MTG_FILTER_CONTROL_TIMEOUT_EN_SHIFT)

/*
 * REV_INI_MODE (RW)
 *
 */
#define MTG_FILTER_CONTROL_REV_INI_MODE_MASK (0x20000UL)
#define MTG_FILTER_CONTROL_REV_INI_MODE_SHIFT (17U)
#define MTG_FILTER_CONTROL_REV_INI_MODE_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_REV_INI_MODE_SHIFT) & MTG_FILTER_CONTROL_REV_INI_MODE_MASK)
#define MTG_FILTER_CONTROL_REV_INI_MODE_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_REV_INI_MODE_MASK) >> MTG_FILTER_CONTROL_REV_INI_MODE_SHIFT)

/*
 * SEL_TIME1 (RW)
 *
 */
#define MTG_FILTER_CONTROL_SEL_TIME1_MASK (0x3000U)
#define MTG_FILTER_CONTROL_SEL_TIME1_SHIFT (12U)
#define MTG_FILTER_CONTROL_SEL_TIME1_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_SEL_TIME1_SHIFT) & MTG_FILTER_CONTROL_SEL_TIME1_MASK)
#define MTG_FILTER_CONTROL_SEL_TIME1_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_SEL_TIME1_MASK) >> MTG_FILTER_CONTROL_SEL_TIME1_SHIFT)

/*
 * SEL_TIME0 (RW)
 *
 */
#define MTG_FILTER_CONTROL_SEL_TIME0_MASK (0xC00U)
#define MTG_FILTER_CONTROL_SEL_TIME0_SHIFT (10U)
#define MTG_FILTER_CONTROL_SEL_TIME0_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_SEL_TIME0_SHIFT) & MTG_FILTER_CONTROL_SEL_TIME0_MASK)
#define MTG_FILTER_CONTROL_SEL_TIME0_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_SEL_TIME0_MASK) >> MTG_FILTER_CONTROL_SEL_TIME0_SHIFT)

/*
 * EN_TIME1 (RW)
 *
 */
#define MTG_FILTER_CONTROL_EN_TIME1_MASK (0x200U)
#define MTG_FILTER_CONTROL_EN_TIME1_SHIFT (9U)
#define MTG_FILTER_CONTROL_EN_TIME1_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_EN_TIME1_SHIFT) & MTG_FILTER_CONTROL_EN_TIME1_MASK)
#define MTG_FILTER_CONTROL_EN_TIME1_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_EN_TIME1_MASK) >> MTG_FILTER_CONTROL_EN_TIME1_SHIFT)

/*
 * EN_TIME0 (RW)
 *
 */
#define MTG_FILTER_CONTROL_EN_TIME0_MASK (0x100U)
#define MTG_FILTER_CONTROL_EN_TIME0_SHIFT (8U)
#define MTG_FILTER_CONTROL_EN_TIME0_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_EN_TIME0_SHIFT) & MTG_FILTER_CONTROL_EN_TIME0_MASK)
#define MTG_FILTER_CONTROL_EN_TIME0_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_EN_TIME0_MASK) >> MTG_FILTER_CONTROL_EN_TIME0_SHIFT)

