RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * A_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_A_EN_MASK (0x40U)
#define MTG_FILTER_CONTROL_A_EN_SHIFT (6U)
#define MTG_FILTER_CONTROL_A_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_A_EN_SHIFT) & MTG_FILTER_CONTROL_A_EN_MASK)
#define MTG_FILTER_CONTROL_A_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_A_EN_MASK) >> MTG_FILTER_CONTROL_A_EN_SHIFT)

/*
 * ERR_INI (RW)
 *
 */
#define MTG_FILTER_CONTROL_ERR_INI_MASK (0x20U)
#define MTG_FILTER_CONTROL_ERR_INI_SHIFT (5U)
#define MTG_FILTER_CONTROL_ERR_INI_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_ERR_INI_SHIFT) & MTG_FILTER_CONTROL_ERR_INI_MASK)
#define MTG_FILTER_CONTROL_ERR_INI_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_ERR_INI_MASK) >> MTG_FILTER_CONTROL_ERR_INI_SHIFT)

/*
 * ERR_BYPASS_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_ERR_BYPASS_EN_MASK (0x10U)
#define MTG_FILTER_CONTROL_ERR_BYPASS_EN_SHIFT (4U)
#define MTG_FILTER_CONTROL_ERR_BYPASS_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_ERR_BYPASS_EN_SHIFT) & MTG_FILTER_CONTROL_ERR_BYPASS_EN_MASK)
#define MTG_FILTER_CONTROL_ERR_BYPASS_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_ERR_BYPASS_EN_MASK) >> MTG_FILTER_CONTROL_ERR_BYPASS_EN_SHIFT)

/*
 * FF_MODE (RW)
 *
 */
#define MTG_FILTER_CONTROL_FF_MODE_MASK (0x8U)
#define MTG_FILTER_CONTROL_FF_MODE_SHIFT (3U)
#define MTG_FILTER_CONTROL_FF_MODE_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_FF_MODE_SHIFT) & MTG_FILTER_CONTROL_FF_MODE_MASK)
#define MTG_FILTER_CONTROL_FF_MODE_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_FF_MODE_MASK) >> MTG_FILTER_CONTROL_FF_MODE_SHIFT)

/*
 * FF_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_FF_EN_MASK (0x4U)
#define MTG_FILTER_CONTROL_FF_EN_SHIFT (2U)
#define MTG_FILTER_CONTROL_FF_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_FF_EN_SHIFT) & MTG_FILTER_CONTROL_FF_EN_MASK)
#define MTG_FILTER_CONTROL_FF_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_FF_EN_MASK) >> MTG_FILTER_CONTROL_FF_EN_SHIFT)

/*
 * INIT_EN (RW)
 *
 */
#define MTG_FILTER_CONTROL_INIT_EN_MASK (0x2U)
#define MTG_FILTER_CONTROL_INIT_EN_SHIFT (1U)
#define MTG_FILTER_CONTROL_INIT_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_INIT_EN_SHIFT) & MTG_FILTER_CONTROL_INIT_EN_MASK)
#define MTG_FILTER_CONTROL_INIT_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_INIT_EN_MASK) >> MTG_FILTER_CONTROL_INIT_EN_SHIFT)

/*
 * ENABLE (RW)
 *
 */
#define MTG_FILTER_CONTROL_ENABLE_MASK (0x1U)
#define MTG_FILTER_CONTROL_ENABLE_SHIFT (0U)
#define MTG_FILTER_CONTROL_ENABLE_SET(x) (((uint32_t)(x) << MTG_FILTER_CONTROL_ENABLE_SHIFT) & MTG_FILTER_CONTROL_ENABLE_MASK)
#define MTG_FILTER_CONTROL_ENABLE_GET(x) (((uint32_t)(x) & MTG_FILTER_CONTROL_ENABLE_MASK) >> MTG_FILTER_CONTROL_ENABLE_SHIFT)

/* Bitfield definition for register: FILTER_REV_VALUE */
/*
 * VALUE (RW)
 *
 */
#define MTG_FILTER_REV_VALUE_VALUE_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_REV_VALUE_VALUE_SHIFT (0U)
#define MTG_FILTER_REV_VALUE_VALUE_SET(x) (((uint32_t)(x) << MTG_FILTER_REV_VALUE_VALUE_SHIFT) & MTG_FILTER_REV_VALUE_VALUE_MASK)
#define MTG_FILTER_REV_VALUE_VALUE_GET(x) (((uint32_t)(x) & MTG_FILTER_REV_VALUE_VALUE_MASK) >> MTG_FILTER_REV_VALUE_VALUE_SHIFT)

/* Bitfield definition for register: FILTER_POS_VALUE */
/*
 * VALUE (RW)
 *
 */
#define MTG_FILTER_POS_VALUE_VALUE_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_POS_VALUE_VALUE_SHIFT (0U)
#define MTG_FILTER_POS_VALUE_VALUE_SET(x) (((uint32_t)(x) << MTG_FILTER_POS_VALUE_VALUE_SHIFT) & MTG_FILTER_POS_VALUE_VALUE_MASK)
#define MTG_FILTER_POS_VALUE_VALUE_GET(x) (((uint32_t)(x) & MTG_FILTER_POS_VALUE_VALUE_MASK) >> MTG_FILTER_POS_VALUE_VALUE_SHIFT)

/* Bitfield definition for register: FILTER_VEL_VALUE */
/*
 * VALUE (RW)
 *
 */
#define MTG_FILTER_VEL_VALUE_VALUE_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_VEL_VALUE_VALUE_SHIFT (0U)
#define MTG_FILTER_VEL_VALUE_VALUE_SET(x) (((uint32_t)(x) << MTG_FILTER_VEL_VALUE_VALUE_SHIFT) & MTG_FILTER_VEL_VALUE_VALUE_MASK)
#define MTG_FILTER_VEL_VALUE_VALUE_GET(x) (((uint32_t)(x) & MTG_FILTER_VEL_VALUE_VALUE_MASK) >> MTG_FILTER_VEL_VALUE_VALUE_SHIFT)

/* Bitfield definition for register: FILTER_ACC_VALUE */
/*
 * VALUE (RW)
 *
 */
#define MTG_FILTER_ACC_VALUE_VALUE_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_ACC_VALUE_VALUE_SHIFT (0U)
#define MTG_FILTER_ACC_VALUE_VALUE_SET(x) (((uint32_t)(x) << MTG_FILTER_ACC_VALUE_VALUE_SHIFT) & MTG_FILTER_ACC_VALUE_VALUE_MASK)
#define MTG_FILTER_ACC_VALUE_VALUE_GET(x) (((uint32_t)(x) & MTG_FILTER_ACC_VALUE_VALUE_MASK) >> MTG_FILTER_ACC_VALUE_VALUE_SHIFT)

/* Bitfield definition for register: FILTER_MOT_SEL */
/*
 * OUTPUT_VEL_SEL (RW)
 *
 */
#define MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_MASK (0x3F000000UL)
#define MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_SHIFT (24U)
#define MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_SHIFT) & MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_MASK)
#define MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_MASK) >> MTG_FILTER_MOT_SEL_OUTPUT_VEL_SEL_SHIFT)

/*
 * OUTPUT_ACC_SEL (RW)
 *
 */
#define MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_MASK (0x3F0000UL)
#define MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_SHIFT (16U)
#define MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_SHIFT) & MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_MASK)
#define MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_MASK) >> MTG_FILTER_MOT_SEL_OUTPUT_ACC_SEL_SHIFT)

/*
 * FILTER_VEL_SEL (RW)
 *
 */
#define MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_MASK (0x3F00U)
#define MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_SHIFT (8U)
#define MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_SHIFT) & MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_MASK)
#define MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_MASK) >> MTG_FILTER_MOT_SEL_FILTER_VEL_SEL_SHIFT)

/*
 * FILTER_ACC_SEL (RW)
 *
 */
#define MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_MASK (0x3FU)
#define MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_SHIFT (0U)
#define MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_SHIFT) & MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_MASK)
#define MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_MASK) >> MTG_FILTER_MOT_SEL_FILTER_ACC_SEL_SHIFT)

/* Bitfield definition for register: FILTER_STAGE_SEL */
/*
 * STAGE5_SEL (RW)
 *
 */
#define MTG_FILTER_STAGE_SEL_STAGE5_SEL_MASK (0x3E000000UL)
#define MTG_FILTER_STAGE_SEL_STAGE5_SEL_SHIFT (25U)
#define MTG_FILTER_STAGE_SEL_STAGE5_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SEL_STAGE5_SEL_SHIFT) & MTG_FILTER_STAGE_SEL_STAGE5_SEL_MASK)
#define MTG_FILTER_STAGE_SEL_STAGE5_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SEL_STAGE5_SEL_MASK) >> MTG_FILTER_STAGE_SEL_STAGE5_SEL_SHIFT)

