RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * STAGE4_SEL (RW)
 *
 */
#define MTG_FILTER_STAGE_SEL_STAGE4_SEL_MASK (0x1F00000UL)
#define MTG_FILTER_STAGE_SEL_STAGE4_SEL_SHIFT (20U)
#define MTG_FILTER_STAGE_SEL_STAGE4_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SEL_STAGE4_SEL_SHIFT) & MTG_FILTER_STAGE_SEL_STAGE4_SEL_MASK)
#define MTG_FILTER_STAGE_SEL_STAGE4_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SEL_STAGE4_SEL_MASK) >> MTG_FILTER_STAGE_SEL_STAGE4_SEL_SHIFT)

/*
 * STAGE3_SEL (RW)
 *
 */
#define MTG_FILTER_STAGE_SEL_STAGE3_SEL_MASK (0xF8000UL)
#define MTG_FILTER_STAGE_SEL_STAGE3_SEL_SHIFT (15U)
#define MTG_FILTER_STAGE_SEL_STAGE3_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SEL_STAGE3_SEL_SHIFT) & MTG_FILTER_STAGE_SEL_STAGE3_SEL_MASK)
#define MTG_FILTER_STAGE_SEL_STAGE3_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SEL_STAGE3_SEL_MASK) >> MTG_FILTER_STAGE_SEL_STAGE3_SEL_SHIFT)

/*
 * STAGE2_SEL (RW)
 *
 */
#define MTG_FILTER_STAGE_SEL_STAGE2_SEL_MASK (0x7C00U)
#define MTG_FILTER_STAGE_SEL_STAGE2_SEL_SHIFT (10U)
#define MTG_FILTER_STAGE_SEL_STAGE2_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SEL_STAGE2_SEL_SHIFT) & MTG_FILTER_STAGE_SEL_STAGE2_SEL_MASK)
#define MTG_FILTER_STAGE_SEL_STAGE2_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SEL_STAGE2_SEL_MASK) >> MTG_FILTER_STAGE_SEL_STAGE2_SEL_SHIFT)

/*
 * STAGE1_SEL (RW)
 *
 */
#define MTG_FILTER_STAGE_SEL_STAGE1_SEL_MASK (0x3E0U)
#define MTG_FILTER_STAGE_SEL_STAGE1_SEL_SHIFT (5U)
#define MTG_FILTER_STAGE_SEL_STAGE1_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SEL_STAGE1_SEL_SHIFT) & MTG_FILTER_STAGE_SEL_STAGE1_SEL_MASK)
#define MTG_FILTER_STAGE_SEL_STAGE1_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SEL_STAGE1_SEL_MASK) >> MTG_FILTER_STAGE_SEL_STAGE1_SEL_SHIFT)

/*
 * STAGE0_SEL (RW)
 *
 */
#define MTG_FILTER_STAGE_SEL_STAGE0_SEL_MASK (0x1FU)
#define MTG_FILTER_STAGE_SEL_STAGE0_SEL_SHIFT (0U)
#define MTG_FILTER_STAGE_SEL_STAGE0_SEL_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SEL_STAGE0_SEL_SHIFT) & MTG_FILTER_STAGE_SEL_STAGE0_SEL_MASK)
#define MTG_FILTER_STAGE_SEL_STAGE0_SEL_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SEL_STAGE0_SEL_MASK) >> MTG_FILTER_STAGE_SEL_STAGE0_SEL_SHIFT)

/* Bitfield definition for register: FILTER_TIME_CONSTANT_TP */
/*
 * TP (RW)
 *
 */
#define MTG_FILTER_TIME_CONSTANT_TP_TP_MASK (0xFFFFFFUL)
#define MTG_FILTER_TIME_CONSTANT_TP_TP_SHIFT (0U)
#define MTG_FILTER_TIME_CONSTANT_TP_TP_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_CONSTANT_TP_TP_SHIFT) & MTG_FILTER_TIME_CONSTANT_TP_TP_MASK)
#define MTG_FILTER_TIME_CONSTANT_TP_TP_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_CONSTANT_TP_TP_MASK) >> MTG_FILTER_TIME_CONSTANT_TP_TP_SHIFT)

/* Bitfield definition for register: FILTER_TIME_CONSTANT_TZ */
/*
 * TZ (RW)
 *
 */
#define MTG_FILTER_TIME_CONSTANT_TZ_TZ_MASK (0xFFFFFFUL)
#define MTG_FILTER_TIME_CONSTANT_TZ_TZ_SHIFT (0U)
#define MTG_FILTER_TIME_CONSTANT_TZ_TZ_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_CONSTANT_TZ_TZ_SHIFT) & MTG_FILTER_TIME_CONSTANT_TZ_TZ_MASK)
#define MTG_FILTER_TIME_CONSTANT_TZ_TZ_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_CONSTANT_TZ_TZ_MASK) >> MTG_FILTER_TIME_CONSTANT_TZ_TZ_SHIFT)

/* Bitfield definition for register: FILTER_TIME_CONSTANT_TZ_1 */
/*
 * TZ_1 (RW)
 *
 */
#define MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_MASK (0xFFFFFFUL)
#define MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SHIFT (0U)
#define MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SHIFT) & MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_MASK)
#define MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_MASK) >> MTG_FILTER_TIME_CONSTANT_TZ_1_TZ_1_SHIFT)

/* Bitfield definition for register: FILTER_ZERO_TZ_SEL */
/*
 * STAGE5 (RW)
 *
 */
#define MTG_FILTER_ZERO_TZ_SEL_STAGE5_MASK (0x20U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE5_SHIFT (5U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE5_SET(x) (((uint32_t)(x) << MTG_FILTER_ZERO_TZ_SEL_STAGE5_SHIFT) & MTG_FILTER_ZERO_TZ_SEL_STAGE5_MASK)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE5_GET(x) (((uint32_t)(x) & MTG_FILTER_ZERO_TZ_SEL_STAGE5_MASK) >> MTG_FILTER_ZERO_TZ_SEL_STAGE5_SHIFT)

/*
 * STAGE4 (RW)
 *
 */
#define MTG_FILTER_ZERO_TZ_SEL_STAGE4_MASK (0x10U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE4_SHIFT (4U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE4_SET(x) (((uint32_t)(x) << MTG_FILTER_ZERO_TZ_SEL_STAGE4_SHIFT) & MTG_FILTER_ZERO_TZ_SEL_STAGE4_MASK)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE4_GET(x) (((uint32_t)(x) & MTG_FILTER_ZERO_TZ_SEL_STAGE4_MASK) >> MTG_FILTER_ZERO_TZ_SEL_STAGE4_SHIFT)

/*
 * STAGE3 (RW)
 *
 */
#define MTG_FILTER_ZERO_TZ_SEL_STAGE3_MASK (0x8U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE3_SHIFT (3U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE3_SET(x) (((uint32_t)(x) << MTG_FILTER_ZERO_TZ_SEL_STAGE3_SHIFT) & MTG_FILTER_ZERO_TZ_SEL_STAGE3_MASK)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE3_GET(x) (((uint32_t)(x) & MTG_FILTER_ZERO_TZ_SEL_STAGE3_MASK) >> MTG_FILTER_ZERO_TZ_SEL_STAGE3_SHIFT)

/*
 * STAGE2 (RW)
 *
 */
#define MTG_FILTER_ZERO_TZ_SEL_STAGE2_MASK (0x4U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE2_SHIFT (2U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE2_SET(x) (((uint32_t)(x) << MTG_FILTER_ZERO_TZ_SEL_STAGE2_SHIFT) & MTG_FILTER_ZERO_TZ_SEL_STAGE2_MASK)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE2_GET(x) (((uint32_t)(x) & MTG_FILTER_ZERO_TZ_SEL_STAGE2_MASK) >> MTG_FILTER_ZERO_TZ_SEL_STAGE2_SHIFT)

/*
 * STAGE1 (RW)
 *
 */
#define MTG_FILTER_ZERO_TZ_SEL_STAGE1_MASK (0x2U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE1_SHIFT (1U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE1_SET(x) (((uint32_t)(x) << MTG_FILTER_ZERO_TZ_SEL_STAGE1_SHIFT) & MTG_FILTER_ZERO_TZ_SEL_STAGE1_MASK)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE1_GET(x) (((uint32_t)(x) & MTG_FILTER_ZERO_TZ_SEL_STAGE1_MASK) >> MTG_FILTER_ZERO_TZ_SEL_STAGE1_SHIFT)

/*
 * STAGE0 (RW)
 *
 */
#define MTG_FILTER_ZERO_TZ_SEL_STAGE0_MASK (0x1U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE0_SHIFT (0U)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE0_SET(x) (((uint32_t)(x) << MTG_FILTER_ZERO_TZ_SEL_STAGE0_SHIFT) & MTG_FILTER_ZERO_TZ_SEL_STAGE0_MASK)
#define MTG_FILTER_ZERO_TZ_SEL_STAGE0_GET(x) (((uint32_t)(x) & MTG_FILTER_ZERO_TZ_SEL_STAGE0_MASK) >> MTG_FILTER_ZERO_TZ_SEL_STAGE0_SHIFT)

