RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/* Bitfield definition for register: FILTER_GAIN */
/*
 * GAIN_T0_EN (RW)
 *
 */
#define MTG_FILTER_GAIN_GAIN_T0_EN_MASK (0x80000000UL)
#define MTG_FILTER_GAIN_GAIN_T0_EN_SHIFT (31U)
#define MTG_FILTER_GAIN_GAIN_T0_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_GAIN_GAIN_T0_EN_SHIFT) & MTG_FILTER_GAIN_GAIN_T0_EN_MASK)
#define MTG_FILTER_GAIN_GAIN_T0_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_GAIN_GAIN_T0_EN_MASK) >> MTG_FILTER_GAIN_GAIN_T0_EN_SHIFT)

/*
 * GAIN_T1_EN (RW)
 *
 */
#define MTG_FILTER_GAIN_GAIN_T1_EN_MASK (0x40000000UL)
#define MTG_FILTER_GAIN_GAIN_T1_EN_SHIFT (30U)
#define MTG_FILTER_GAIN_GAIN_T1_EN_SET(x) (((uint32_t)(x) << MTG_FILTER_GAIN_GAIN_T1_EN_SHIFT) & MTG_FILTER_GAIN_GAIN_T1_EN_MASK)
#define MTG_FILTER_GAIN_GAIN_T1_EN_GET(x) (((uint32_t)(x) & MTG_FILTER_GAIN_GAIN_T1_EN_MASK) >> MTG_FILTER_GAIN_GAIN_T1_EN_SHIFT)

/*
 * K (RW)
 *
 */
#define MTG_FILTER_GAIN_K_MASK (0xFFFFFFUL)
#define MTG_FILTER_GAIN_K_SHIFT (0U)
#define MTG_FILTER_GAIN_K_SET(x) (((uint32_t)(x) << MTG_FILTER_GAIN_K_SHIFT) & MTG_FILTER_GAIN_K_MASK)
#define MTG_FILTER_GAIN_K_GET(x) (((uint32_t)(x) & MTG_FILTER_GAIN_K_MASK) >> MTG_FILTER_GAIN_K_SHIFT)

/* Bitfield definition for register: FILTER_STAGE_SHIFT0 */
/*
 * STAGE3_SHIFT1 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_MASK (0xF0000000UL)
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SHIFT (28U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT1_SHIFT)

/*
 * STAGE3_SHIFT0 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_MASK (0xF000000UL)
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_SHIFT (24U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE3_SHIFT0_SHIFT)

/*
 * STAGE2_SHIFT1 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_MASK (0xF00000UL)
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_SHIFT (20U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT1_SHIFT)

/*
 * STAGE2_SHIFT0 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_MASK (0xF0000UL)
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_SHIFT (16U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE2_SHIFT0_SHIFT)

/*
 * STAGE1_SHIFT1 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_MASK (0xF000U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_SHIFT (12U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT1_SHIFT)

/*
 * STAGE1_SHIFT0 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_MASK (0xF00U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_SHIFT (8U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE1_SHIFT0_SHIFT)

/*
 * STAGE0_SHIFT1 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_MASK (0xF0U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_SHIFT (4U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT1_SHIFT)

/*
 * STAGE0_SHIFT0 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_MASK (0xFU)
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_SHIFT (0U)
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_SHIFT) & MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_MASK)
#define MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_MASK) >> MTG_FILTER_STAGE_SHIFT0_STAGE0_SHIFT0_SHIFT)

/* Bitfield definition for register: FILTER_STAGE_SHIFT1 */
/*
 * STAGE5_SHIFT1 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_MASK (0xF000U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SHIFT (12U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SHIFT) & MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_MASK)
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_MASK) >> MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT1_SHIFT)

/*
 * STAGE5_SHIFT0 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_MASK (0xF00U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_SHIFT (8U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_SHIFT) & MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_MASK)
#define MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_MASK) >> MTG_FILTER_STAGE_SHIFT1_STAGE5_SHIFT0_SHIFT)

