RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * STAGE4_SHIFT1 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_MASK (0xF0U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_SHIFT (4U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_SHIFT) & MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_MASK)
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_MASK) >> MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT1_SHIFT)

/*
 * STAGE4_SHIFT0 (RW)
 *
 */
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_MASK (0xFU)
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_SHIFT (0U)
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_SET(x) (((uint32_t)(x) << MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_SHIFT) & MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_MASK)
#define MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_GET(x) (((uint32_t)(x) & MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_MASK) >> MTG_FILTER_STAGE_SHIFT1_STAGE4_SHIFT0_SHIFT)

/* Bitfield definition for register: FILTER_PARAM_SHIFT */
/*
 * ACC_SHIFT_PARAM (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_MASK (0xF0000000UL)
#define MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SHIFT (28U)
#define MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SHIFT) & MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_MASK)
#define MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_MASK) >> MTG_FILTER_PARAM_SHIFT_ACC_SHIFT_PARAM_SHIFT)

/*
 * VEL_SHIFT_PARAM (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_MASK (0xF000000UL)
#define MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SHIFT (24U)
#define MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SHIFT) & MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_MASK)
#define MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_MASK) >> MTG_FILTER_PARAM_SHIFT_VEL_SHIFT_PARAM_SHIFT)

/*
 * GAIN_K_SHIFT (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_MASK (0xF00000UL)
#define MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SHIFT (20U)
#define MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SHIFT) & MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_MASK)
#define MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_MASK) >> MTG_FILTER_PARAM_SHIFT_GAIN_K_SHIFT_SHIFT)

/*
 * GAIN_T0_SHIFT (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_MASK (0xF0000UL)
#define MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SHIFT (16U)
#define MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SHIFT) & MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_MASK)
#define MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_MASK) >> MTG_FILTER_PARAM_SHIFT_GAIN_T0_SHIFT_SHIFT)

/*
 * GAIN_T1_SHIFT (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_MASK (0xF000U)
#define MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SHIFT (12U)
#define MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SHIFT) & MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_MASK)
#define MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_MASK) >> MTG_FILTER_PARAM_SHIFT_GAIN_T1_SHIFT_SHIFT)

/*
 * TP_SHIFT (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_TP_SHIFT_MASK (0xF00U)
#define MTG_FILTER_PARAM_SHIFT_TP_SHIFT_SHIFT (8U)
#define MTG_FILTER_PARAM_SHIFT_TP_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_TP_SHIFT_SHIFT) & MTG_FILTER_PARAM_SHIFT_TP_SHIFT_MASK)
#define MTG_FILTER_PARAM_SHIFT_TP_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_TP_SHIFT_MASK) >> MTG_FILTER_PARAM_SHIFT_TP_SHIFT_SHIFT)

/*
 * TZ_1_SHIFT (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_MASK (0xF0U)
#define MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_SHIFT (4U)
#define MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_SHIFT) & MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_MASK)
#define MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_MASK) >> MTG_FILTER_PARAM_SHIFT_TZ_1_SHIFT_SHIFT)

/*
 * TZ_SHIFT (RW)
 *
 */
#define MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_MASK (0xFU)
#define MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_SHIFT (0U)
#define MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_SHIFT) & MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_MASK)
#define MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_MASK) >> MTG_FILTER_PARAM_SHIFT_TZ_SHIFT_SHIFT)

/* Bitfield definition for register: FILTER_TIME_SHIFT */
/*
 * ACC_SHIFT_TIME1 (RW)
 *
 */
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_MASK (0xF000U)
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SHIFT (12U)
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SHIFT) & MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_MASK)
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_MASK) >> MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME1_SHIFT)

/*
 * VEL_SHIFT_TIME1 (RW)
 *
 */
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_MASK (0xF00U)
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SHIFT (8U)
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SHIFT) & MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_MASK)
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_MASK) >> MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME1_SHIFT)

/*
 * ACC_SHIFT_TIME0 (RW)
 *
 */
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_MASK (0xF0U)
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SHIFT (4U)
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SHIFT) & MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_MASK)
#define MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_MASK) >> MTG_FILTER_TIME_SHIFT_ACC_SHIFT_TIME0_SHIFT)

