RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_mtg_regs.h
/*
 * VEL_SHIFT_TIME0 (RW)
 *
 */
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_MASK (0xFU)
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SHIFT (0U)
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SHIFT) & MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_MASK)
#define MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_MASK) >> MTG_FILTER_TIME_SHIFT_VEL_SHIFT_TIME0_SHIFT)

/* Bitfield definition for register: FILTER_FF_SHIFT */
/*
 * OUTPUT_ACC_SHIFT (RW)
 *
 */
#define MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_MASK (0xF000U)
#define MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SHIFT (12U)
#define MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SHIFT) & MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_MASK)
#define MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_MASK) >> MTG_FILTER_FF_SHIFT_OUTPUT_ACC_SHIFT_SHIFT)

/*
 * FILTER_ACC_SHIFT (RW)
 *
 */
#define MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_MASK (0xF00U)
#define MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SHIFT (8U)
#define MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SHIFT) & MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_MASK)
#define MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_MASK) >> MTG_FILTER_FF_SHIFT_FILTER_ACC_SHIFT_SHIFT)

/*
 * OUTPUT_VEL_SHIFT (RW)
 *
 */
#define MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_MASK (0xF0U)
#define MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SHIFT (4U)
#define MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SHIFT) & MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_MASK)
#define MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_MASK) >> MTG_FILTER_FF_SHIFT_OUTPUT_VEL_SHIFT_SHIFT)

/*
 * FILTER_VEL_SHIFT (RW)
 *
 */
#define MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_MASK (0xFU)
#define MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SHIFT (0U)
#define MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SET(x) (((uint32_t)(x) << MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SHIFT) & MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_MASK)
#define MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_GET(x) (((uint32_t)(x) & MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_MASK) >> MTG_FILTER_FF_SHIFT_FILTER_VEL_SHIFT_SHIFT)

/* Bitfield definition for register: FILTER_TIME1_SW_ADJUST */
/*
 * TIME (RW)
 *
 */
#define MTG_FILTER_TIME1_SW_ADJUST_TIME_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_TIME1_SW_ADJUST_TIME_SHIFT (0U)
#define MTG_FILTER_TIME1_SW_ADJUST_TIME_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME1_SW_ADJUST_TIME_SHIFT) & MTG_FILTER_TIME1_SW_ADJUST_TIME_MASK)
#define MTG_FILTER_TIME1_SW_ADJUST_TIME_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME1_SW_ADJUST_TIME_MASK) >> MTG_FILTER_TIME1_SW_ADJUST_TIME_SHIFT)

/* Bitfield definition for register: FILTER_TIME0_SW_ADJUST */
/*
 * TIME (RW)
 *
 */
#define MTG_FILTER_TIME0_SW_ADJUST_TIME_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_TIME0_SW_ADJUST_TIME_SHIFT (0U)
#define MTG_FILTER_TIME0_SW_ADJUST_TIME_SET(x) (((uint32_t)(x) << MTG_FILTER_TIME0_SW_ADJUST_TIME_SHIFT) & MTG_FILTER_TIME0_SW_ADJUST_TIME_MASK)
#define MTG_FILTER_TIME0_SW_ADJUST_TIME_GET(x) (((uint32_t)(x) & MTG_FILTER_TIME0_SW_ADJUST_TIME_MASK) >> MTG_FILTER_TIME0_SW_ADJUST_TIME_SHIFT)

/* Bitfield definition for register: FILTER_ERROR_LIMIT_L */
/*
 * ERROR_LIMIT_L (RW)
 *
 */
#define MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_SHIFT (0U)
#define MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_SET(x) (((uint32_t)(x) << MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_SHIFT) & MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_MASK)
#define MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_GET(x) (((uint32_t)(x) & MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_MASK) >> MTG_FILTER_ERROR_LIMIT_L_ERROR_LIMIT_L_SHIFT)

/* Bitfield definition for register: FILTER_ERROR_LIMIT_H */
/*
 * ERROR_LIMIT_H (RW)
 *
 */
#define MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_SHIFT (0U)
#define MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_SET(x) (((uint32_t)(x) << MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_SHIFT) & MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_MASK)
#define MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_GET(x) (((uint32_t)(x) & MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_MASK) >> MTG_FILTER_ERROR_LIMIT_H_ERROR_LIMIT_H_SHIFT)

/* Bitfield definition for register: FILTER_TIMEOUT_CNT */
/*
 * TIMEOUT_CNT (RW)
 *
 */
#define MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SHIFT (0U)
#define MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SET(x) (((uint32_t)(x) << MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SHIFT) & MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_MASK)
#define MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_GET(x) (((uint32_t)(x) & MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_MASK) >> MTG_FILTER_TIMEOUT_CNT_TIMEOUT_CNT_SHIFT)

/* Bitfield definition for register: FILTER_REV_LOCK */
/*
 * REV_STATUS (RO)
 *
 */
#define MTG_FILTER_REV_LOCK_REV_STATUS_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_REV_LOCK_REV_STATUS_SHIFT (0U)
#define MTG_FILTER_REV_LOCK_REV_STATUS_GET(x) (((uint32_t)(x) & MTG_FILTER_REV_LOCK_REV_STATUS_MASK) >> MTG_FILTER_REV_LOCK_REV_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_POS_LOCK */
/*
 * POS_STATUS (RO)
 *
 */
#define MTG_FILTER_POS_LOCK_POS_STATUS_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_POS_LOCK_POS_STATUS_SHIFT (0U)
#define MTG_FILTER_POS_LOCK_POS_STATUS_GET(x) (((uint32_t)(x) & MTG_FILTER_POS_LOCK_POS_STATUS_MASK) >> MTG_FILTER_POS_LOCK_POS_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_VEL_LOCK */
/*
 * VEL_STATUS (RO)
 *
 */
#define MTG_FILTER_VEL_LOCK_VEL_STATUS_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_VEL_LOCK_VEL_STATUS_SHIFT (0U)
#define MTG_FILTER_VEL_LOCK_VEL_STATUS_GET(x) (((uint32_t)(x) & MTG_FILTER_VEL_LOCK_VEL_STATUS_MASK) >> MTG_FILTER_VEL_LOCK_VEL_STATUS_SHIFT)

/* Bitfield definition for register: FILTER_ACC_LOCK */
/*
 * ACC_STATUS (RO)
 *
 */
#define MTG_FILTER_ACC_LOCK_ACC_STATUS_MASK (0xFFFFFFFFUL)
#define MTG_FILTER_ACC_LOCK_ACC_STATUS_SHIFT (0U)
#define MTG_FILTER_ACC_LOCK_ACC_STATUS_GET(x) (((uint32_t)(x) & MTG_FILTER_ACC_LOCK_ACC_STATUS_MASK) >> MTG_FILTER_ACC_LOCK_ACC_STATUS_SHIFT)



/* CMD register group index macro definition */
#define MTG_CMD_0 (0UL)
#define MTG_CMD_1 (1UL)
#define MTG_CMD_2 (2UL)
#define MTG_CMD_3 (3UL)

/* TRA register group index macro definition */
#define MTG_TRA_0 (0UL)
#define MTG_TRA_1 (1UL)

/* EVENT register group index macro definition */
#define MTG_EVENT_0 (0UL)
#define MTG_EVENT_1 (1UL)
#define MTG_EVENT_2 (2UL)
#define MTG_EVENT_3 (3UL)


#endif /* HPM_MTG_H */
